// Задача 1. Оптимізація вибіркового рендеру з useMemo та React.memo
// Створіть компонент-калькулятор, який має два незалежні поля вводу: одне для числа A і одне для числа B.
//  Також є окремий компонент ResultDisplay, який відображає A + B. Обгорніть ResultDisplay у React.memo().
// Використайте useMemo в батьківському компоненті, щоб обчислити A + B і передати цей результат до ResultDisplay.
//  Переконайтеся, що ResultDisplay ререндериться лише тоді, коли змінюються A або B,
//  а не коли змінюється інший незалежний стан у батьківському компоненті (наприклад, лічильник, що не впливає на A чи B).

import { memo } from "react";

function ResultDisplay({ result }) {
  console.log("Виведення результату");

  return <div>{result}</div>;
}

export default memo(ResultDisplay);
